In [2]:
import pandas as pd
import numpy as np

# Create a sample dataset for the test
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Helen", "Ivan", "Judy", 
             "Kyle", "Laura", "Mona", "Nathan", "Olivia"],
    "Age": [25, 34, 29, 42, 30, 33, 28, 26, 40, 31, 36, 22, 27, 35, 29],
    "City": ["New York", "Los Angeles", "Chicago", "New York", "Los Angeles", "Chicago", "New York", 
             "San Francisco", "San Francisco", "Los Angeles", "Chicago", "New York", "Chicago", 
             "San Francisco", "Los Angeles"],
    "Salary": [70000, 80000, 55000, 120000, 75000, 64000, 58000, 61000, 97000, 73000, 66000, 52000, 57000, 88000, 68000],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "Finance", "HR", "IT", "Finance", "HR", 
                   "IT", "Finance", "HR", "Finance", "IT"]
}

df = pd.DataFrame(data)
df.head()

# Display the dataset for the user to see
#import ace_tools as tools; tools.display_dataframe_to_user(name="Sample Dataset for Pandas Study Test", dataframe=df)

      Name  Age         City  Salary Department
0    Alice   25     New York   70000         HR
1      Bob   34  Los Angeles   80000         IT
2  Charlie   29      Chicago   55000    Finance
3    David   42     New York  120000         IT
4      Eva   30  Los Angeles   75000         HR

In [3]:
df['Salary'].mean()

np.float64(72266.66666666667)

In [4]:
df['Department'].value_counts()

Department
HR         5
IT         5
Finance    5
Name: count, dtype: int64

In [5]:
df.loc[df['Salary'].idxmax()]

Name             David
Age                 42
City          New York
Salary          120000
Department          IT
Name: 3, dtype: object

In [6]:
df.sort_values(by='Salary', ascending=False)

       Name  Age           City  Salary Department
3     David   42       New York  120000         IT
8      Ivan   40  San Francisco   97000    Finance
13   Nathan   35  San Francisco   88000    Finance
1       Bob   34    Los Angeles   80000         IT
4       Eva   30    Los Angeles   75000         HR
9      Judy   31    Los Angeles   73000         HR
0     Alice   25       New York   70000         HR
14   Olivia   29    Los Angeles   68000         IT
10     Kyle   36        Chicago   66000         IT
5     Frank   33        Chicago   64000    Finance
7     Helen   26  San Francisco   61000         IT
6     Grace   28       New York   58000         HR
12     Mona   27        Chicago   57000         HR
2   Charlie   29        Chicago   55000    Finance
11    Laura   22       New York   52000    Finance

In [10]:
under_30 = df[df['Age'] > 30]
len(under_30)

7

In [13]:
finance_ppl = df[df['Department'] == 'Finance']
print(finance_ppl)

       Name  Age           City  Salary Department
2   Charlie   29        Chicago   55000    Finance
5     Frank   33        Chicago   64000    Finance
8      Ivan   40  San Francisco   97000    Finance
11    Laura   22       New York   52000    Finance
13   Nathan   35  San Francisco   88000    Finance

In [14]:
finance_ppl['Age'].mean()

np.float64(31.8)

In [18]:
nyc_hr = df[(df['City'] == 'New York') & (df['Department'] == 'HR')]
print(nyc_hr)

    Name  Age      City  Salary Department
0  Alice   25  New York   70000         HR
6  Grace   28  New York   58000         HR

In [21]:
len(nyc_hr)

2

In [25]:
chicago_ppl = df[df['City'] == 'Chicago']
chicago_ppl['Salary'].sum()

np.int64(242000)

In [26]:
df.groupby('Department')['Salary'].mean().sort_values(ascending=False)

Department
IT         79000.0
Finance    71200.0
HR         66600.0
Name: Salary, dtype: float64

In [27]:
average_salary = df['Salary'].mean()
above_average = df[df['Salary'] > average_salary]
len(above_average)

6

In [28]:
#NEW DATABASE

In [ ]:
#import pandas as pd

#df = pd.read_csv("CSVNNAME.csv")
#df.head()